bababooex/STM8_TV_TRANSMITTER/RFmod_bare_metal/inc/swi2c.h
#ifndef __STM8_SWI2C_H
#define __STM8_SWI2C_H

/* Version 1.4
editlist:
17.1.2023 - added function swi2c_write_array() - to send nonstructured block of data without "address byte" (slave address is sent of course)
 3.9.2023 - corrected "i" variable tu uint16_t (more then 256 bytes crashes...)
					- added function swi2c_write_array_wctrbyte() (for effective SSD1306 support)
10.4.2024 - added functions swi2c_write_eemem() and swi2c_read_eemem() for EEPROMs witn 16bit address
4.6.2024 - removed function function swi2c_write_array_wctrbyte() - duplicate of swi2c_write_buf()

*/

// Software (bit bang) Master I2C library V1.0
#include "stm8s_delay.h"
#include <stdlib.h>
// ---- USER EDIT SECTION ----
// select GPIOs
#define SCL_GPIO PD
#define SCL_PIN PIN3
#define SDA_GPIO PD
#define SDA_PIN PIN2

// coarse timing parameters (~us) 
#define SWI2C_START_STOP_TIME 5
#define SWI2C_SDA_SETUP_TIME 5
#define SWI2C_SDA_HOLD_TIME 5
#define SWI2C_SCL_HALFPERIOD_TIME 5
// timeouts
#define SWI2C_TIMEOUT 0xffff // maximum number of waiting cycles

// ---- NO EDIT SECTION ----

#define SCL_stat() ((PORT(SCL_GPIO, IDR) & SCL_PIN) ? 1 : 0)
#define SDA_stat() ((PORT(SDA_GPIO, IDR) & SDA_PIN) ? 1 : 0)

#define SCL_HIGH (PORT(SCL_GPIO, ODR) |= SCL_PIN) 
#define SCL_LOW (PORT(SCL_GPIO, ODR) &= ~SCL_PIN)  
#define SDA_HIGH (PORT(SDA_GPIO, ODR) |= SDA_PIN)  
#define SDA_LOW (PORT(SDA_GPIO, ODR) &= ~SDA_PIN) 

#define SWI2C_SS_TIME delay_us(SWI2C_START_STOP_TIME)
#define SWI2C_SETUP_TIME delay_us(SWI2C_SDA_SETUP_TIME)
#define SWI2C_HOLD_TIME delay_us(SWI2C_SDA_HOLD_TIME)
#define SWI2C_SCL_HIGH_TIME delay_us(SWI2C_SCL_HALFPERIOD_TIME)

// user functions
void swi2c_init(void); // init GPIOs as Open Drain outputs
uint8_t swi2c_test_slave(uint8_t slvaddr); // check if slave with selected addres is present on bus
uint8_t swi2c_write_buf(uint8_t slv_addr, uint8_t address, uint8_t* data, uint16_t num); // SLA+W - 1B(Address) - num*1B(data)
uint8_t swi2c_read_buf(uint8_t slv_addr, uint8_t address, uint8_t* data, uint16_t num); // SLA+W - 1B(Address) - RST - SLA+R + num*1B(data)
uint8_t swi2c_write_array(uint8_t slv_addr, uint8_t* data, uint16_t num); // SLA+W - num*1B(data)
//experimental
uint8_t swi2c_read_array(uint8_t slv_addr, uint8_t* data, uint16_t num); // SLA+W - num*1B(data)

uint8_t swi2c_write_eemem(uint8_t slv_addr, uint16_t address, uint8_t* data, uint16_t num); // SLA+W - 2B (address) - num*1B(data)
uint8_t swi2c_read_eemem(uint8_t slv_addr, uint16_t address, uint8_t* data, uint16_t num); // SLA+W - 2B (address) - RST - SLA+R + num*1B(data)
uint8_t swi2c_recover(void);

// private functions
uint8_t swi2c_writebit(uint8_t bit);
uint8_t swi2c_readbit(void);
uint8_t swi2c_START(void);
uint8_t swi2c_RESTART(void);
uint8_t swi2c_STOP(void);



#endif /* __STM8_SWI2C_H*/
